import os
from pathlib import Path
from dotenv import load_dotenv

load_dotenv()

IOU_THRESHOLD = 0.95
SPLITS = ['train', 'val', 'test']
# THETA_1_pos = 0.10 # між двома горбами внутрішньовідеового розподілу
#                  # прибирає дублікати від уповільнення, зберігає різноманіття
# THETA_2_pos = 0.538  # p25 міжвідеового розподілу
#                  # прибирає міжвідеові дублікати не чіпаючи унікальні сцени
THETA_1 = 0.020 # між двома горбами внутрішньовідеового розподілу
                 # прибирає дублікати від уповільнення, зберігає різноманіття
THETA_2 = 0.025   # p25 міжвідеового розподілу
                 # прибирає міжвідеові дублікати не чіпаючи унікальні сцени